---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.TotalStreams
source: html/529c6a0e-c331-6079-e1d7-94cd1af90f59.htm
---
# Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.TotalStreams Property

The total expected number of streams to save to local.

## Syntax (C#)
```csharp
public int TotalStreams { get; }
```